[
    "Identify the route with the longest distance traveled by any of its trips in the GTFS feed.",
    "Find the dates with available service in the GTFS feed.",
    "Retrieve the list of all routes in the GTFS feed sorted by route type.",
    "Determine the service IDs associated with a {specific} trip ID in the GTFS feed.",
    "Calculate the total number of trips for {given} service ID.",
    "Count the total number of trips in the GTFS feed across all service IDs.",
    "Identify the busiest transfer points in the network by analyzing stop_times and transfers data in the GTFS feed.",
    "Identify all the services that run on weekdays only.",
    "Find the most common stop location across all routes in the GTFS feed.",
    "Find the trips that operate for a particular service ID in the GTFS feed.",
    "Calculate the average dwell time at each stop for {given} route",
    "List all unique stop names in a {specified} route.",
    "Calculate the percentage of stops that are time points (stops where the vehicle is scheduled to arrive at a {specific} time) in the GTFS feed.",
    "Find the longest route in terms of distance traveled.",
    "Identify unique stop names across different routes in the GTFS feed.",
    "Extract the unique route IDs present in the GTFS feed.",
    "Identify the `service_ids` that have the highest frequency of trips.",
    "Determine the peak hours for trips on {given} route.",
    "Find the route with the highest number of transfers required (based on the number of unique trip_ids in stop_times).",
    "Determine if a stop is located on multiple routes in the GTFS feed.",
    "Find the busiest stop in the network based on the number of routes serving it.",
    "Find the average delay time (if any) for a {specific} trip based on stop_times.",
    "Calculate the percentage of trips that are wheelchair-accessible for {given} route in the GTFS feed.",
    "Determine the total number of trips scheduled for a {specific} day across all routes.",
    "List all the stops for {given} route.",
    "Identify all trips for a {specific} stop and calculate their departure times.",
    "Find the arrival and departure times of {given} trip for a {specific} stop.",
    "Get the service IDs for all trips running on a {specific} day in the GTFS feed.",
    "Find the trips passing through {given} stop and their headways on the busiest date in the GTFS feed.",
    "Analyze the frequency of stop usage by calculating the total arrival counts at each stop.",
    "Find the average number of trips departing from a {specific} stop on weekdays.",
    "Find the routes with the highest and lowest average speed based on scheduled times and distances.",
    "Load the GTFS feed and extract all unique `stop_ids` from the feed.",
    "Determine the average number of stop times for all trips under a {specific} route ID in the GTFS feed.",
    "Determine the number of shapes that correspond to a {specific} route.",
    "Extract the maximum `shape_dist_traveled` for any shape in the GTFS feed.",
    "Calculate the average spacing between stops for {given} trip in the GTFS feed.",
    "Identify the unique route types present in the GTFS feed and return the list of route types.",
    "Find the stop that has the earliest scheduled arrival time in the GTFS feed.",
    "Calculate the average speed of a {specific} route during its entire journey.",
    "Calculate the average speed of trips for each route, considering only the trips that operate during weekdays.",
    "Compute the number of trip segments that have a travel time greater than 30 minutes in the GTFS feed.",
    "Analyze the frequency of service for a {specific} route throughout the week.",
    "Check for any missing values in critical GTFS tables (stops and routes).",
    "Determine how many routes operate during peak hours (e.g., 7 AM to 9 AM).",
    "Identify the route with the shortest average trip duration in the GTFS feed.",
    "Find the service IDs that are active on a {specific} day and count them.",
    "Summarize the total distance covered by trips on a {specific} route for {given} date in the GTFS feed.",
    "Filter trips based on a {specific} service type in the GTFS feed.",
    "Load the GTFS feed and return the trips data for {given} service ID.",
    "Find the number of trips in the GTFS feed that pass through {given} stop.",
    "Find the trip with the longest duration on {given} route.",
    "Check if a {specific} route in the GTFS feed has any trips with wheelchair accessible vehicles.",
    "Identify all route IDs that do not have any associated fare information.",
    "Identify all services that are not operational on Mondays for {given} route.",
    "Find the stop pair with the longest travel time between them in the GTFS feed.",
    "Calculate the average number of trips for a {specific} route across all active service days.",
    "Calculate the average speed of trips for {given} route, assuming `shape_dist_traveled` is in meters.",
    "Find and list all route IDs that have been defined in the GTFS feed but currently have no associated trips.",
    "Identify routes that have no trips scheduled on weekdays.",
    "Identify all unique routes that have a {specific} stop in the GTFS feed.",
    "Calculate the average speed of trips for each route type in the network.",
    "Find the shape information for {given} trip in the GTFS feed and return the sequence of shape points with their coordinates.",
    "Identify the routes that have bi-directional service (trips in both directions).",
    "Create a frequency distribution of trip durations across all routes in the network.",
    "Find all routes that are circular (start and end stop are same)",
    "Identify the busiest transfer point in the network based on the number of routes intersecting at a stop.",
    "Create a summary report of the number of trips per route in the GTFS feed.",
    "Identify the stop with the highest number of arrivals for {given} route on its busiest day.",
    "Find all trips that have a {specific} stop as the first stop.",
    "List all stops for given `route_id` and their respective sequences in the GTFS feed.",
    "Calculate the total number of trips for each day of the week in the GTFS feed.",
    "Find the maximum number of trips scheduled for a {specific} stop in a day.",
    "Find the last stop for a {specific} trip.",
    "Find out the total number of unique trips in the GTFS feed for a {specified} route on its busiest date.",
    "Check if a {specific} stop in the GTFS feed is a time point for any trips.",
    "Extract the trip counts for each service ID on the busiest date in the GTFS feed.",
    "Read the dates for which the GTFS feed has service data.",
    "Load the GTFS feed with geographic data for spatial analysis.",
    "Determine the total duration of service across all trips in a {specific} route.",
    "Retrieve the first five trips of a {specific} route based on the given `route_id`.",
    "Extract the list of all route names in the GTFS feed.",
    "Analyze the distribution of service IDs across weekdays and weekends in the GTFS feed.",
    "Find the earliest and latest service dates in the GTFS feed.",
    "Calculate the percentage of trips delayed by more than 5 minutes in the GTFS feed for a {specific} route.",
    "Find the busiest stop in terms of the number of unique routes served during a {specific} time window.",
    "Find the geographical center (centroid) of all stops in the GTFS feed.",
    "Determine the longest trip duration for any route on a {specific} date in the GTFS feed.",
    "Find the longest continuous route (in terms of number of stops) in the GTFS feed.",
    "Create a histogram of the distribution of trip durations for {given} route in the GTFS feed.",
    "Filter and display all trips on a {specific} route from the GTFS feed.",
    "Find the route with the highest number of transfer points (stops shared with other routes).",
    "Find the total number of unique stops served by a {specific} route.",
    "Identify the first and last service IDs for a {specific} service period in the GTFS feed.",
    "Identify all trips that have a {specific} stop included in their route.",
    "Calculate the average number of stops per trip for a {specific} route.",
    "Calculate the average trip duration for a {specific} route on weekdays vs weekends.",
    "Calculate the total operating hours for each route on the busiest day.",
    "Identify all trips that are scheduled to serve a {specific} stop given `stop_id`.",
    "Determine the busiest stop in terms of arriving trips for a {specific} route on the busiest day.",
    "List all trips that operate on weekdays only in the GTFS feed.",
    "Find the number of unique trip patterns (combination of stops visited in sequence) in the GTFS feed.",
    "Read the busiest date in terms of the number of trips in the GTFS feed.",
    "Find the number of service IDs associated with a trip on the busiest date.",
    "Find the time period with the highest frequency of trips across all routes.",
    "Identify the least used stop in the GTFS feed based on the number of trips it is part of.",
    "Find the total number of routes that operate on a {specific} stop.",
    "Calculate the proportion of trips made by each route type in the GTFS feed.",
    "Determine the average number of trips per service on the busiest week.",
    "Find the list of stops and their corresponding routes in the GTFS feed for {given} `stop_id`.",
    "Find the headway of a stop in the GTFS feed on busiest day, given `route_id`",
    "Calculate the total number of trips serving {given} stop in the GTFS feed.",
    "List the routes that have only one trip in the GTFS feed.",
    "Check for any routes in the GTFS feed that have no trips scheduled.",
    "Find all unique stop names associated with {given} `route_id` in the GTFS feed.",
    "Find the busiest stop (most trips) in the GTFS feed for a {specific} date.",
    "Determine the route types available in the GTFS feed and count the number of each type.",
    "Identify the stop with the most transfers (different routes serving the stop) in the GTFS feed.",
    "Retrieve the route ID for the longest trip in the GTFS feed.",
    "Find the first and last stop on a {specified} trip in the GTFS feed.",
    "Retrieve all unique route IDs in the GTFS feed.",
    "Determine the peak service hours for all routes in the GTFS feed.",
    "Calculate the average waiting time at {given} stop in the GTFS feed.",
    "Find the stop pair with the highest number of direct connections (trips that serve both stops without intermediate stops) in the entire GTFS feed.",
    "Find the stops that are only active on weekends.",
    "Determine the total trip count for all services on the busiest week in the GTFS feed.",
    "Calculate the frequency of a {specific} trip within a week in the GTFS feed.",
    "Find the total number of stops that are not wheelchair accessible in the GTFS feed.",
    "Calculate the total number of trips that operate during peak hours (e.g., 7 AM to 9 AM) for a {specific} route in the GTFS feed.",
    "Find the route with the most stops in the GTFS feed.",
    "Find all trips that have a {specific} `route_id` but do not serve {given} stop.",
    "Find the total number of trips per day for all services in the GTFS feed.",
    "Return the busiest week in the GTFS feed.",
    "Find the percentage of trips that are delayed by more than 5 minutes for a {specific} route in the GTFS feed.",
    "Calculate the average speed of trips for {given} route during off-peak hours (10 AM - 3 PM) on weekdays.",
    "Find the number of hours {given} route is in service for",
    "Determine the shortest scheduled trip in terms of duration in the GTFS feed.",
    "Retrieve all `trip_ids` that operate on a {specific} route during a busy week.",
    "Identify the busiest day of the week for public transport usage in the GTFS feed.",
    "Extract all trips for a {specific} route in the GTFS feed.",
    "Check if {given} stop is part of any routes in the GTFS feed.",
    "Identify the first and last trip times for {given} route on the busiest date in the GTFS feed.",
    "List all route IDs that have a {specific} stop ID as part of their service.",
    "Identify all trips that have a {specific} stop as both the start and end point.",
    "Find the segment that is traversed the highest number of times by trips in the feed",
    "Identify all services that include the given stop in the GTFS feed.",
    "Find the longest sequence of consecutive days with active services in the GTFS feed.",
    "Find all service IDs that have at least one trip on the busiest week in the GTFS feed.",
    "Identify all routes that are marked as 'Not in Service' in the GTFS feed.",
    "Count the distinct routes available in the GTFS data.",
    "Calculate the total number of trips and unique routes operating during each hour of the day on the busiest day in the GTFS feed.",
    "Count the number of trips with service on weekends in the GTFS feed.",
    "Find the total fare for all trips of {given} service ID in the GTFS feed.",
    "Find the route with the longest total duration (sum of all trip durations) on a weekday.",
    "Retrieve the list of routes available in the GTFS feed and their respective IDs.",
    "Find all routes served on the busiest day in the GTFS feed.",
    "Find all trips that stop at a {specific} stop.",
    "Find which stop has the longest distance traveled from the start of its route.",
    "Find the stop with the longest average waiting time between consecutive trips.",
    "List all unique trip IDs for a {specific} route in the GTFS feed.",
    "Calculate the total distance covered by all trips in the GTFS feed on the busiest day.",
    "Determine the total number of trips for {given} route over the entire GTFS period.",
    "Read the geographical information from the GTFS feed.",
    "Find the earliest and latest operating hours for each day of the week.",
    "Identify the top 5 busiest stops based on the total number of trips.",
    "Determine the total number of trips scheduled for a {specified} route on the busiest date.",
    "Extract service IDs for all services operating on holidays.",
    "Find the stop with the most transfers (i.e., served by the most routes) in the GTFS feed.",
    "Filter the GTFS feed for routes that have weekday service and print their IDs.",
    "Find the number of transfer points (stops served by more than one route) in the GTFS feed.",
    "Determine how many routes are available for a {specific} service ID.",
    "Identify the service IDs that operate on the same dates as {given} route from the GTFS feed.",
    "Find the stop with the highest number of arrivals in the GTFS feed.",
    "Identify all routes that operate on a {specific} service date.",
    "Calculate the total distance covered by all trips of a {specific} route on {given} date.",
    "Calculate the maximum trip distance for each route in the GTFS feed, assuming stop distances are uniform.",
    "Analyze the distribution of trips across routes and output the route with the most trips.",
    "Count how many trips serve a {specific} stop on a {specific} date.",
    "Identify the longest trip duration recorded for a {specific} route.",
    "Calculate the total travel time for all trips of {given} route on a {specific} date.",
    "Find all stops that are part of {given} route in the GTFS feed.",
    "Determine the service IDs active on weekends in the GTFS feed.",
    "Extract the maximum arrival time for trips on a {specific} route.",
    "Find all routes that have a {specific} stop ID in their sequence.",
    "Extract all trips that have a {specific} stop as their final destination.",
    "Calculate the percentage of routes that are of type subway in the GTFS feed.",
    "Identify all trips on a {specific} route that have delays greater than 10 minutes in the GTFS feed.",
    "Determine the total number of trips in the GTFS feed for {given} `service_id` on the busiest day.",
    "Determine the total distance covered by all trips of a {specific} route.",
    "Find all trips that operate on a {specified} route id.",
    "Generate a frequency table showing the number of trips departing each hour for a {specific} route on weekdays.",
    "Identify the routes that have the highest variation in trip duration throughout the day.",
    "Calculate the percentage of trips that operate on holidays.",
    "Retrieve the service IDs for all services that operate on a {specified} date in the GTFS feed.",
    "Find the route with the highest number of trips during the busiest week.",
    "Find all trips that are scheduled within a certain time window on a {specific} date.",
    "Calculate the percentage of trips that are express services (fewer stops than average) for each route.",
    "Determine the number of trips that operate on weekdays vs. weekends.",
    "Find all trip IDs for a {specified} service ID in the GTFS feed.",
    "Calculate the average number of trips per day in the GTFS feed for {given} route.",
    "Find the maximum wait time at any stop in the GTFS feed on the busiest day.",
    "Find the first stop in the route for a {specified} trip ID.",
    "Find the route that operates the earliest in the morning and the route that operates the latest at night.",
    "Determine the number of trips made on each route for the busiest day in the GTFS feed.",
    "Count how many unique services operate on {given} route.",
    "Identify the busiest transfer points between different agencies in the GTFS feed.",
    "Identify the trips that cover the most distance in the GTFS feed.",
    "Find the route with the highest number of different trip patterns.",
    "Retrieve the name of the stop with the most departures in the GTFS feed.",
    "Retrieve the service IDs that operate on {given} route ID.",
    "Identify the time period with the highest service frequency across all routes in the GTFS feed.",
    "Identify all unique route types present in the GTFS feed and their counts.",
    "Find the busiest stop in terms of the number of trips serving it on the busiest day.",
    "Check for any duplicate route IDs in the GTFS feed.",
    "Retrieve the service IDs for all weekends within the GTFS feed.",
    "Identify the oldest active service in the GTFS feed.",
    "Retrieve the earliest departure time from the GTFS feed.",
    "Calculate the total trip count for all routes on a {specific} date in the GTFS feed.",
    "Calculate the average trip duration across all trips in the GTFS feed.",
    "Find the stop with the shortest average time between arrivals in the GTFS feed.",
    "Identify the longest route in the GTFS feed based on the shape data.",
    "Determine the average headway time (in seconds) between trips for a {specified} route id.",
    "Find and print the average distance of all routes in the GTFS feed.",
    "Retrieve stop information for a {specific} stop ID.",
    "Find the busiest hour of the day for {given} route in the GTFS feed.",
    "Determine the maximum number of stops for any individual trip in the GTFS feed.",
    "Find the route with the longest total distance in the GTFS feed.",
    "Identify and list all service IDs that correspond to the weekdays in the GTFS feed.",
    "Find all trips that have a {specific} service ID.",
    "Find all unique route IDs serving a {specific} stop on the busiest day.",
    "Analyze the distribution of trips per route across the GTFS feed.",
    "Calculate the average number of stop times for trips of a {specific} route.",
    "Check if a {specific} stop is served during the service span of a route.",
    "Filter the GTFS feed to include only trips that run on weekends.",
    "Find the longest trip on a {specific} route in terms of time duration in the GTFS feed.",
    "Find the service that starts and ends on the same day in the GTFS feed.",
    "Determine the number of unique routes serving a particular stop.",
    "Find the longest route in terms of the number of stops in the GTFS feed.",
    "Find the stops that are transfer points between two or more routes.",
    "Determine the total number of different routes that serve a {specific} stop in the GTFS feed.",
    "Find the route that operates on weekends within the GTFS feed.",
    "Identify all trips that have a stop at {given} stop ID in the GTFS feed.",
    "Evaluate the variation in route types present in the GTFS feed.",
    "Extract all the unique `stop_ids` that have associated trips in the GTFS feed.",
    "Find and print the count of trips on each route for {given} service ID using the GTFS feed.",
    "Find the total number of different stops used across all routes in the GTFS feed.",
    "Find the trips that visit {given} stop in the GTFS feed.",
    "Compile a report of the total number of routes and stops in the GTFS feed.",
    "Find the trips that have the most number of stopovers in the GTFS feed, given the route_id.",
    "Calculate the longest route in terms of distance from the GTFS feed.",
    "Identify the longest route in terms of distance from the GTFS feed.",
    "Identify the most popular route based on the number of trips in the GTFS feed.",
    "Find the top three stops by the number of trips served in the GTFS feed.",
    "Read all available trip counts by date in the GTFS feed.",
    "Determine how many stops are located along {given} route.",
    "Find the service IDs that operate only on weekdays.",
    "Determine which routes have no trips scheduled on {given} day.",
    "Determine the number of unique stop sequences across all trips in the GTFS feed.",
    "Find the average number of stops per trip for a {specific} route in the GTFS feed.",
    "Identify the most frequent `service_id` for trips on all routes in the GTFS feed.",
    "Find the route with the highest frequency of service during a {specified} time window on the busiest date.",
    "Find the stop that serves as the most used transfer point between different routes in the GTFS feed.",
    "Find the stops that are served by the most number of distinct routes.",
    "Find all trips that start from a {specific} stop for {given} route.",
    "Count the total number of unique `trip_ids` associated with {given} `service_id`.",
    "Count the number of routes that have trip patterns that run in both directions in the GTFS feed.",
    "Find the routes that pass through a {specified} `stop_id` in the GTFS feed.",
    "Retrieve the service IDs associated with {given} stop.",
    "Determine the percentage of timepoints in a {specific} trip in the GTFS feed.",
    "Check if a {specific} route_id exists in the GTFS feed.",
    "Find the service IDs that correspond to the days with the least service in the GTFS feed.",
    "Identify the routes with the highest and lowest service span (time between first and last trip) on weekdays.",
    "Retrieve and print the trip IDs for all trips associated with {given} route ID in the GTFS feed.",
    "Identify the highest number of trips scheduled in a single day.",
    "Find the stop pair with the highest number of direct connections (trips without transfers) between them.",
    "Extract the geographical data for a {specific} route from the GTFS feed.",
    "Find all trips that have a stop in a location with a {specific} stop name.",
    "Identify the latest service ID in the GTFS feed based on the service period.",
    "Calculate the average trip speed for {given} route in the GTFS feed.",
    "Find the longest continuous service period (in days) for any route in the GTFS feed.",
    "Identify the route with the shortest travel time based on stop times.",
    "Find the earliest and latest operating dates for services in the GTFS feed.",
    "Find all fares from {given} stop in the GTFS feed",
    "Find the service IDs that are active on Mondays but not on Sundays in the GTFS feed.",
    "Determine the `service_ids` that run on a {specific} route.",
    "Find the stop with the highest number of departures per day.",
    "Identify the most frequent stop location for {given} route.",
    "Extract the shape data for a {specific} route.",
    "Count how many unique trips are associated with a {specific} `service_id`.",
    "Find all trips that start and end at the same stop for all routes.",
    "Identify the peak hours for {given} stop in the GTFS feed.",
    "Find out which routes have the most connections in the GTFS feed.",
    "List all routes in the GTFS feed along with their trip counts.",
    "Find all the routes that have at least 100 trips in the GTFS feed.",
    "Find the service IDs that have no active trips during the weekend.",
    "Find all trips operated by a {specific} service ID in the GTFS feed.",
    "Identify all the routes that have been added in the last year using the GTFS feed.",
    "Find the longest continuous segment (in terms of time) without any stops for {given} trip.",
    "Find the route with the highest on-time performance, assuming a trip is on-time if it arrives at its final stop within 5 minutes of the scheduled time.",
    "List all stops served by {given} route on a {specified} day.",
    "Calculate the average speed of trips during peak hours (7-9 AM and 4-6 PM) versus off-peak hours for {given} route.",
    "Find the number of trips that stop at {given} stop for a {specific} time range in the GTFS feed.",
    "List all service IDs along with their corresponding active dates in the GTFS feed.",
    "List all service IDs that have a {specific} stop within their route in the GTFS feed.",
    "Find the number of trips of a route in the GTFS feed, given `route_id`",
    "Identify the stops that are only served during peak hours in the GTFS feed.",
    "Analyze the distribution of trips across different days of the week in the GTFS feed.",
    "Extract the list of unique stop names served by a {specific} route.",
    "Determine the frequency of a {specific} stop for all trips passing through it.",
    "Determine the most common transfer time between trips at {given} stop.",
    "Generate a list of routes that have no active service on weekends in the GTFS feed.",
    "Calculate the average speed of all trips in the GTFS feed, considering only trips with shape data.",
    "Find the total number of trips on the busiest day in the GTFS feed.",
    "Check if a {specific} service operates on a holiday in the GTFS feed.",
    "Load the GTFS feed and extract the geographical shapes data.",
    "Identify all service IDs that have trips on multiple days in the GTFS feed.",
    "Retrieve the last scheduled arrival time for a {specific} stop.",
    "Find the transfer points (stops shared by multiple routes) with the highest number of connecting routes.",
    "Generate a frequency table for {given} route, showing the number of trips per hour throughout the day.",
    "Determine the most common `direction_id` for trips on a {specific} route using the GTFS data.",
    "Identify the routes with the most and least frequent service in the GTFS feed.",
    "Identify the routes that have been assigned to a {specific} service ID.",
    "List all the unique service IDs available in the GTFS feed.",
    "Find the date range for service availability in the GTFS feed.",
    "Find all stops that are wheelchair accessible in the GTFS feed.",
    "Find the route with the highest frequency (trips per hour) during weekday mornings (6-10 AM).",
    "Determine the number of available service IDs in the GTFS feed.",
    "Determine the busiest route ID based on the number of trips on the busiest date.",
    "Calculate the percentage of accessible trips (trips using wheelchair-accessible vehicles) for each route.",
    "Find the number of unique routes operating on weekends in the GTFS feed.",
    "Extract the stop times for a {specific} trip in the GTFS feed.",
    "Generate a list of all stops along a {specific} route, ordered by their sequence in the trip.",
    "Retrieve the list of routes with wheelchair-accessible services in the GTFS feed",
    "Identify all routes that connect to a {specific} stop.",
    "Identify the shape ID associated with a {specific} trip in the GTFS feed.",
    "Find the number of trips operating on a {specified} service ID.",
    "Find all stop IDs that are served by more than one route.",
    "Filter and list all routes that connect to a {specified} stop in the GTFS feed.",
    "Determine the most frequent stop among all trips in the GTFS feed.",
    "Find the longest trip duration for a {specified} route on {given} date.",
    "Determine the number of different route types available in the GTFS feed.",
    "Find all routes that do not require a fare in the GTFS feed.",
    "Find the top 5 busiest stops based on the number of trips serving each stop.",
    "Find the busiest service ID based on total trips for {given} route.",
    "Identify the maximum number of trips that can be scheduled for {given} route on any day.",
    "Find the route with the highest frequency of service during weekdays.",
    "Determine the longest route in the network based on the total distance traveled.",
    "Retrieve all routes that have more than one `direction_id` in the GTFS feed.",
    "Retrieve the operating days for a {specific} service ID.",
    "Find all routes that connect at a certain stop.",
    "Count the total number of trips scheduled for {given} route on a {specific} day.",
    "Identify the most common `route_id` used in trips within the GTFS feed.",
    "Identify the routes that do not operate on a {specific} date in the GTFS feed.",
    "Find all the unique stop names that contain the word 'Station' in the GTFS feed.",
    "Find the earliest departure time across all trips in the GTFS feed.",
    "Find how many stops in the GTFS feed are wheelchair accessible",
    "Find the longest trip (by distance) in the entire GTFS feed.",
    "Determine how many trips operate on the busiest date in the GTFS feed.",
    "Identify the stop with the earliest arrival time for {given} trip id in the GTFS feed.",
    "List all stops for a {specific} route, including their names and IDs.",
    "Find the routes in the GTFS feed that have a trip with the longest duration.",
    "Find the average trip duration for a {specific} route using stop times.",
    "Identify routes that have a service type of 'express' in the GTFS feed.",
    "Identify which routes have more than one shape associated with them in the GTFS feed.",
    "Filter trips operating between two {specific} times for {given} route in the GTFS feed.",
    "Retrieve the route details for a {specific} `route_id`.",
    "Identify the longest service span across all routes in the GTFS feed.",
    "Determine the peak hours for trips of {given} route in the GTFS feed during weekdays.",
    "Find the longest continuous segment without stops for each route in the GTFS feed.",
    "Find the service frequency for the given route (i.e., the average time between consecutive trips) in the GTFS feed.",
    "Identify the busiest route in terms of the number of trips on a {specific} date.",
    "Find all trips that pass through {given} stop.",
    "Identify all trips that run on weekends (Saturday and Sunday) in the GTFS feed.",
    "Calculate the total distance covered by a {specific} route in the GTFS feed.",
    "Find out how many different service IDs exist in the GTFS feed.",
    "Count the number of routes that have at least one trip operating after midnight.",
    "Filter the GTFS feed for a {specific} date in the feed and return the feed object",
    "Analyze the average headway between trips on {given} route.",
    "Calculate the average trip length in the GTFS feed for {given} route.",
    "Find the date range of the GTFS feed based on available service dates.",
    "Find the stop with the longest dwell time (time spent at the stop) for a {specific} route in the GTFS feed, given the `route_id`.",
    "Identify the routes that operate 24\/7 (have trips starting in every hour of the day).",
    "Identify all trips corresponding to a {specific} `stop_id` in the GTFS feed.",
    "Find the shortest route in the GTFS feed by distance.",
    "Get the list of all available route IDs in the GTFS feed.",
    "Determine if a {specific} route operates on weekdays only in the GTFS feed.",
    "List the trips that operate during evening hours (e.g., 5 PM to 10 PM).",
    "Filter trips by a {specific} `service_id` in the GTFS feed and count the trips.",
    "Calculate the percentage of routes that operate during nighttime hours (12 AM to 5 AM) on weekdays.",
    "Find the stops with the longest and shortest dwell times in the GTFS feed.",
    "Find the trip counts for each date in the GTFS feed.",
    "Retrieve the shape of a route given its `route_id` in the GTFS feed.",
    "Find all the stops served by a particular route on its busiest day.",
    "Retrieve the service IDs corresponding to trips that use a {specific} stop in the GTFS feed.",
    "Check if a {specific} trip on a route has a wheelchair-accessible service in the GTFS feed.",
    "Identify all stops that are not served on weekends.",
    "List all route names along with their respective route IDs from the GTFS feed.",
    "Find all routes passing through a {specific} stop in the GTFS feed.",
    "Find the earliest departure time of all trips for {given} service ID.",
    "Read the GTFS feed and return the busiest date based on the most number of trips.",
    "Generate a report of the trip counts for all routes in the GTFS feed.",
    "Find the busiest week for trips in the GTFS feed",
    "Find all service IDs associated with a {specific} route on the busiest day of the GTFS feed.",
    "Find all unique routes operating on {given} service ID.",
    "Retrieve the shape coordinates for a {specified} route.",
    "Identify any duplicate trips based on `trip_id` and `service_id` in the GTFS feed.",
    "Find the route names and their IDs available in the GTFS feed.",
    "List all the unique shapes used in a {specific} route.",
    "Identify routes that have no weekend service.",
    "Count the number of stops that are isolated i.e. present on only one route",
    "Identify the stops with the most number of transfers between routes in the GTFS feed.",
    "Find all the trips that have the same stop as both their departure and arrival in the GTFS feed.",
    "Find all the routes that operate during peak hours (e.g., 7 AM to 9 AM) using the GTFS feed.",
    "Find the route with the highest on-time performance (least deviation from scheduled times) in the GTFS feed.",
    "Count the number of routes in the GTFS feed that have the given fare amount",
    "Calculate the average waiting time between trips at a {specific} stop during {given} time window.",
    "Find the longest trip in the GTFS feed based on distance.",
    "Create a function that returns the service frequency for {given} route in the GTFS feed.",
    "Determine the earliest and latest times a {specified} stop is served in a day.",
    "Find the number of trips for each service ID in the GTFS feed.",
    "Identify all routes that have at least one trip on a {specific} date.",
    "Determine the frequency of trips for a {specific} route during peak hours.",
    "Identify the most common service IDs in the GTFS feed.",
    "Count the total number of stops in the GTFS feed.",
    "Identify the route with the earliest departing trip in the GTFS feed.",
    "Retrieve the shapes associated with a {specific} route.",
    "Get the list of unique service IDs and corresponding dates from the GTFS feed.",
    "Retrieve the first and last service date from the GTFS feed.",
    "Find the time when the last trip departs from {given} stop",
    "Find all unique service IDs that are associated with a {specific} stop.",
    "Identify all active service IDs on weekends from the GTFS feed.",
    "Check if a {specific} stop has real-time arrival and departure information in the GTFS feed.",
    "Identify the date when a {specific} route had the fewest trips in the GTFS feed.",
    "Identify all stop pairs that have direct trips between them in the GTFS feed.",
    "Find the route with the most variations in its schedule across different days of the week.",
    "Calculate the average number of trips per hour for {given} route on the busiest day.",
    "Identify the trips available on a {specific} day for {given} route.",
    "Retrieve all routes that operate in both directions.",
    "Calculate the total number of active routes for a {specific} service on {given} date in the GTFS feed.",
    "Fetch the shape IDs associated with a particular route ID.",
    "Determine the earliest service start time on a {specific} route.",
    "Find the maximum trip duration for a {specific} service in the GTFS feed.",
    "List all the trips associated with a {specific} service ID.",
    "List all unique shape IDs from the trips in the GTFS feed.",
    "Create a route summary for all routes, including `route_id` and the total number of trips.",
    "Find all trips on a {specific} route that have wheelchair accessible vehicles in the GTFS feed.",
    "Calculate the percentage of accessible stops (`wheelchair_boarding` = 1) in the GTFS feed.",
    "Get the total number of unique routes operated by a {specific} service ID across all dates in the GTFS feed.",
    "Find the average stop sequence position for trips of {given} route.",
    "Read the dates and their corresponding service IDs from the GTFS feed.",
    "Calculate the average headway between trips for {given} `route_id` during a {specified} time window.",
    "Assess and print the total number of trips scheduled on weekends.",
    "Identify the evening peak hours for trips in the GTFS feed.",
    "Retrieve the list of stops along a {specific} route in the GTFS feed.",
    "Count the total number of trips for all service IDs on the busiest date.",
    "Extract all active services and their corresponding dates from the GTFS feed.",
    "Calculate the average time between departures for a {specific} trip.",
    "Identify the service IDs that don't operate on Sundays within the GTFS feed.",
    "Retrieve the distinct route types available in the GTFS feed.",
    "Count the total number of routes in the GTFS feed that serve a {specific} stop.",
    "List all unique `route_ids` that have trips scheduled during peak hours (7 AM to 9 AM).",
    "Calculate the total number of trips for all routes on a {specific} date.",
    "Determine the route with the most frequent service during peak hours (7-9 AM) on weekdays.",
    "Calculate the total distance covered by a {specific} route based on the shape data.",
    "Calculate average arrival delays for trips on a {specific} route using GTFS data.",
    "Retrieve the total number of unique routes in the GTFS feed.",
    "Determine the maximum number of trips that a service ID has in a single day.",
    "Identify the maximum number of trips that occur in a single day in the GTFS feed.",
    "Find the start and end service dates for a {specified} route in the GTFS feed.",
    "Identify the routes with the most stops based on the GTFS feed data.",
    "Generate a frequency table for {given} route, showing how often it runs during different times of the day.",
    "Identify which routes have a stop that is not served by any trips in the GTFS feed.",
    "Find the distance between the two given stop ids",
    "Find the route with the highest percentage of trips that serve {given} stop.",
    "Identify the trip with the shortest duration for a {specified} route_id in the GTFS feed.",
    "Find the total number of unique services offered during a {specified} time period in the GTFS feed.",
    "Retrieve all trips that have no scheduled stop times in the GTFS feed.",
    "Identify the route with the earliest start time and latest end time in the GTFS feed.",
    "Calculate the proportion of bus routes in the GTFS feed, including a breakdown of all route types.",
    "Identify the unique stop names associated with {given} route.",
    "Determine the latest arrival time for a {specific} stop on a {specific} route in the GTFS feed.",
    "Identify the route that is scheduled to operate the most frequently within a week.",
    "Determine the most frequent service pattern (sequence of stops) for {given} route in the GTFS feed.",
    "Find the next bus from {given} stop on a {specific} route in the GTFS feed.",
    "Determine the total number of unique stops within a {specified} route.",
    "Find out how many unique routes serve a {specific} stop.",
    "Extract the first and last departure times for all trips on a particular route.",
    "Identify all night bus routes (routes with trips starting after midnight) in the GTFS feed.",
    "Calculate the total number of trips operated on each day of the week in the GTFS feed.",
    "Calculate the percentage of wheelchair-accessible trips for each route in the GTFS feed.",
    "List all stops with the same name from the GTFS feed.",
    "Find the service interval (frequency) for {given} `trip_id`.",
    "Calculate the total number of distinct routes that connect two {specific} stops.",
    "Determine the earliest and latest service dates in the GTFS feed.",
    "Identify all service IDs for {given} route that operate on a {specific} day.",
    "Find the maximum and minimum arrival times for a {specific} service ID.",
    "Filter trips for a {specific} route that operate only during peak hours in the GTFS feed.",
    "Calculate the total distance traveled for all trips in a {specific} route.",
    "Count how many services are scheduled on weekends within the GTFS feed.",
    "Load the entire GTFS feed into memory for further processing.",
    "Determine which stop has the earliest scheduled arrival time for a {specific} route on the busiest day.",
    "Extract all trips for a {specific} route on {given} day in the GTFS feed.",
    "Retrieve all the trip IDs for a {specific} `stop_id` on the busiest day in the GTFS feed.",
    "Identify all trips that are part of a {specific} route but do not operate on weekdays.",
    "List the route types available in the GTFS feed with their counts.",
    "Count the number of unique service dates available in the GTFS data.",
    "Retrieve the busiest service id on the most active day in the GTFS feed.",
    "Identify the maximum number of trips that can be made on a {specific} service ID in a day from the GTFS data.",
    "Calculate the average number of trips per route on weekends.",
    "Identify the route with the most trips on the busiest date in the GTFS feed.",
    "Analyze the service gaps by examining the time intervals between trips for a route.",
    "Identify all trips for a {specific} route that operate during morning hours (6 AM to 9 AM).",
    "Identify the maximum arrival time for {given} service on the busiest day in the GTFS feed.",
    "Find the number of stops with `stop_name` ending with `Street` in the GTFS feed.",
    "Calculate the average trip duration for a {specific} route on the busiest day.",
    "Find the busiest hour of the day based on the number of trip departures across all stops.",
    "Retrieve the stop ID for the busiest stop on a {specific} route.",
    "Find the stops that are served by all routes in the GTFS feed.",
    "Calculate the average headway between trips for a {specific} route during peak hours (7-9 AM) on weekdays.",
    "Check which routes have the same stop as {given} route.",
    "Identify the top three busiest routes in the GTFS feed based on trip frequency.",
    "Identify the routes that serve a {specific} stop given its `stop_id`.",
    "Analyze service patterns by counting the number of unique service IDs for each route in the GTFS feed.",
    "Find the routes that operate 24\/7 (all days of the week, including overnight service) in the GTFS feed.",
    "Determine the longest route based on the number of shape points in the GTFS feed.",
    "Calculate the proportion of routes that operate on weekends in the GTFS feed.",
    "Determine the number of distinct services on {given} day.",
    "Find the date on which {given} stop is visited the most in the GTFS feed.",
    "Identify express routes (routes with fewer stops than average) in the GTFS feed.",
    "Find the first and last dates of service in the GTFS feed.",
    "List all the stops served by a {specific} route and their respective sequence in the trip.",
    "Analyze and print the first service date in the GTFS feed.",
    "Find the average headway (time between consecutive trips) for {given} route in the GTFS feed.",
    "Analyze and print the average trip duration for {given} route.",
    "Identify the routes with the most transfers at a {specific} stop.",
    "Retrieve the geographical coordinates (longitude and latitude) for a {specific} stop in the GTFS feed.",
    "Calculate the average speed of a vehicle on a {specific} route in the GTFS feed, given the `route_id`.",
    "Find the service hours for {given} route.",
    "Find the most frequent stop on a {specific} route using the GTFS data.",
    "Identify the longest route based on shape distance.",
    "Calculate the average number of stops per trip for each route type (e.g., bus, rail, tram) in the GTFS feed.",
    "Check how many unique stop locations exist in the GTFS feed.",
    "Calculate the average speed of a vehicle traveling between two given stops in the GTFS feed.",
    "Extract the first scheduled arrival time for a {specific} stop on a {specified} trip.",
    "Determine the earliest scheduled trip for a {specific} route in the GTFS feed.",
    "Retrieve the list of unique stop IDs served by a particular route on the busiest week.",
    "Calculate how many routes are served by more than one trip in the GTFS feed.",
    "Analyze the trip schedule and find the average departure time for trips on {given} route.",
    "Retrieve the route ID of the first scheduled trip for a {specific} stop in the GTFS feed.",
    "List all available routes in the GTFS feed with their respective route types.",
    "Identify the service patterns for a {specific} route across all days.",
    "Find all routes available in the GTFS feed, and return the list of unique route IDs.",
    "Analyze peak hours for {given} route based on trip departure times.",
    "Find the trips and their corresponding service IDs for the busiest week in the GTFS feed.",
    "Check for any service disruptions by looking for gaps in the service calendar in the GTFS feed.",
    "Calculate the total service hours for all routes in the GTFS feed on {given} date.",
    "Determine the most common stop in terms of the number of times it appears in the GTFS feed.",
    "Find all unique `route_ids` operating on a {specific} `service_id` within the GTFS feed.",
    "Retrieve all the stop names for a {specific} route in the GTFS feed.",
    "Calculate the total number of trips for a {specific} route that include wheelchair-accessible vehicles in the GTFS feed.",
    "Find the stop with the highest number of routes serving it in the GTFS feed.",
    "Retrieve all the distinct service IDs that operate on weekends.",
    "Discover which `service_id` has the most trips in the GTFS feed.",
    "Determine the number of unique fare attributes defined in the GTFS feed.",
    "Determine the service frequency of a {specific} route during a {specified} time window.",
    "Identify all the stops served by a {specific} trip in the GTFS feed.",
    "Find the most common transfer point (stop) in the network.",
    "Identify the stops with the highest number of different routes passing through them in the GTFS feed.",
    "Find the longest continuous segment (sequence of stops) that is common to multiple routes.",
    "Identify the busiest route based on trip counts in the GTFS feed.",
    "Find the total duration of service for a {specific} route over all active service days.",
    "Analyze the frequency of service for each route in the GTFS feed by counting the number of trips per route.",
    "Count the number of stops in a route within the GTFS feed, given `route_id`",
    "Find the stops passed by the longest trip in the GTFS feed.",
    "Find the number of distinct fare classes available in the GTFS feed.",
    "Determine the stops that are visited by a {specific} route in the GTFS feed.",
    "Evaluate which stop has the most arrivals in the GTFS feed.",
    "Calculate the frequency of trips for {given} route and date.",
    "Find the trip with the maximum number of stops for {given} route.",
    "List all the unique `stop_ids` that are not served by any route.",
    "Calculate the average service duration for trips on the busiest day of the GTFS feed.",
    "Calculate the average trip speed in the GTFS feed for {given} trip.",
    "Find the peak service IDs in the GTFS feed for the busiest day.",
    "Identify all the shape IDs related to a {specific} route in the GTFS feed.",
    "Count the number of routes that have only one service ID associated with them.",
    "Identify trips running during peak hours (7 AM to 9 AM) for a {specific} route.",
    "Calculate the service frequency for {given} route on the busiest date.",
    "Find the stops that have wheelchair boarding capability in the GTFS feed.",
    "List all routes with no scheduled trips in the GTFS feed.",
    "Find the average number of routes served by each stop in the GTFS feed.",
    "Calculate the total service hours for each route on a typical weekday in the GTFS feed.",
    "Retrieve the stop name corresponding to {given} stop id.",
    "Find the maximum number of trips available for any single service ID in the GTFS feed.",
    "Extract the stop names and their coordinates for all stops in the GTFS feed.",
    "Determine the earliest and latest service dates across the GTFS feed.",
    "Count the number of trips that do not stop at any wheelchair accessible stops.",
    "Determine the frequency of service for {given} route based on the number of trips per day.",
    "Find the stop with the highest number of departures in the GTFS feed.",
    "Find the transfer points (stops served by multiple routes) in the GTFS feed and rank them by the number of routes they serve.",
    "Retrieve the stop details for {given} `stop_id`.",
    "Calculate the distance traveled by {given} trip in the GTFS feed.",
    "Identify transfer points in the GTFS feed by finding stops shared by multiple routes.",
    "Find the route with the earliest first trip and the latest last trip in the GTFS feed.",
    "Determine the number of unique service patterns in the GTFS feed.",
    "Find the most common route type in the GTFS feed.",
    "Identify the route with the highest number of trips on the busiest day from the GTFS feed.",
    "Find the top 5 busiest stops (most visits) in the GTFS feed on the busiest day.",
    "Find the stop with the highest number of transfer possibilities (i.e., the stop served by the most routes).",
    "Extract and list all routes that operate on weekends.",
    "Identify the stops that are only active on weekends (i.e., not served by any weekday trips).",
    "Calculate the average speed of all trips in the GTFS feed during off-peak hours.",
    "List all trips that use a {specific} stop during the service period.",
    "Find the stops along {given} route in the GTFS feed and return the stop sequence with arrival and departure times.",
    "Retrieve all active routes in the GTFS feed for a {specified} date.",
    "Find the average wait time for passengers at a {specific} stop during a {specific} time range in the GTFS feed.",
    "Calculate the total number of distinct routes serving a {specific} stop.",
    "Analyze route performance by calculating the number of trips per day for a {specific} route.",
    "Find the service dates available in the GTFS feed for a {specific} route.",
    "Count the number of different routes that share the same `shape_id` in the GTFS feed.",
    "Determine the busiest day in the GTFS feed related to a {specific} route.",
    "Identify the first trip of the day for each route in the GTFS feed.",
    "Calculate the number of trips for a {specific} date within the GTFS feed.",
    "Find the percentage of trips that have a {specific} stop included based on `stop_id`.",
    "Identify all trips that operate on a {specific} service ID and their corresponding routes.",
    "Determine which stops have the longest layover times in the GTFS feed.",
    "Find all trips that serve a {specific} stop on a particular date in the GTFS feed.",
    "Find the number of unique routes that serve {given} stop.",
    "Generate a list of all transfer points where passengers can switch between different route types (e.g., bus to rail).",
    "Find the longest trip in terms of duration for {given} route.",
    "Determine the most common trip pattern for a {specific} route.",
    "Identify the stops with the longest dwell times (time spent at a stop) for {given} route.",
    "List the stops with wheelchair accessibility in the GTFS feed.",
    "Determine the route with the most trips on {given} date.",
    "Find the trips that have the longest travel time in the GTFS feed.",
    "Find the routes that operate only on weekdays.",
    "Calculate the maximum wait time between consecutive trips for a {specific} route.",
    "Calculate the average travel time for {given} route.",
    "Calculate the average speed of each route during peak hours (7-9 AM and 4-6 PM) on weekdays.",
    "Identify the routes that have never been used on any trip in the GTFS feed.",
    "Find all service IDs that operate on holidays from the GTFS feed.",
    "Count how many distinct stops are served by a {specific} route in the GTFS feed.",
    "Calculate the average trip duration for {given} route in the GTFS feed.",
    "Examine the distribution of trip counts by `route_id` in the GTFS feed.",
    "Determine the geographical bounds (north, east, south, west) of all stops in the GTFS feed.",
    "Review all the stops for a {specific} route and their corresponding arrival times.",
    "Identify the busiest service ID over the entire GTFS feed.",
    "List all shapes associated with a particular route in the GTFS feed.",
    "Find the last service ID for a {specified} trip on the busiest date.",
    "Retrieve the trip IDs for all trips stopping at a {specific} stop.",
    "Retrieve the names of all routes that serve a {specific} stop.",
    "List all service IDs that have a trip on the given route on weekdays.",
    "Determine the total travel time for a {specific} trip in the GTFS feed.",
    "Calculate the frequency of a route's trips during peak hours in the GTFS feed.",
    "Calculate the total number of trips for a route that operates on weekends only.",
    "Identify the service IDs that have the maximum number of trips in {given} week.",
    "Generate a list of all stop IDs that are served by a {specific} route in the GTFS feed.",
    "Identify all `stop_ids` with no scheduled trips on a {specific} date.",
    "Analyze the service frequency for a {specific} route on a {specific} date in the GTFS feed.",
    "Retrieve the stop sequences for all stops on {given} route.",
    "Find the route with the latest trip departure time.",
    "List all the stops for a {specific} `service_id` in the GTFS feed.",
    "Identify the stops with the longest average waiting time between trips during weekday peak hours (7-9 AM and 4-6 PM).",
    "Count how many different services operate each day of the week in the GTFS feed.",
    "Identify the service IDs associated with trips operating on {given} date.",
    "Check if a {specific} `trip_id` belongs to a circular route in the GTFS feed.",
    "Calculate the total travel time for each trip in the GTFS feed and find the longest trip.",
    "Find the stops with no scheduled departures in the GTFS feed.",
    "Find the route with the most circular path (smallest difference between start and end coordinates).",
    "Find the scheduled trips in the GTFS feed on busiest day, given start and end time",
    "Generate a list of all transfer points (stops where multiple routes intersect) in the GTFS feed.",
    "Find the longest trip duration on a {specified} route and its corresponding `trip_id`.",
    "Find the most popular `service_id` in terms of the number of trips.",
    "Calculate the total number of trips that pass through {given} stop on the busiest day in the GTFS feed.",
    "Find the stops that are visited by the maximum number of routes in the GTFS feed.",
    "Find all active routes for a {specific} service ID.",
    "Calculate the number of trips for each route in the GTFS feed, and return the route with the highest number of trips.",
    "Analyze the average waiting time at a {specific} stop for a route on the busiest day in the GTFS feed.",
    "Identify the route with the most variations in trip patterns (different stop sequences) in the GTFS feed.",
    "Extract all stop names for {given} `route_id`.",
    "Find the stop with the most scheduled arrivals across all routes in the GTFS feed.",
    "Extract the geographical shapes of routes from the GTFS feed.",
    "Find the most common start and end times for trips in the GTFS feed.",
    "Calculate the average speed of trips for each route, considering the distance between stops and travel time.",
    "Determine the span of service for {given} route by calculating the first and last trip times.",
    "Determine the `service_ids` that operate on the maximum number of weekdays in the GTFS feed.",
    "Identify the service IDs that do not operate on weekends.",
    "Find all trips on {given} route for a {specific} date in the GTFS feed.",
    "Find the route with the highest frequency (trips per hour) during peak hours (7-9 AM and 4-6 PM) on a weekday.",
    "Identify the date with the least number of trips in the GTFS feed.",
    "Find the number of unique routes in the GTFS feed.",
    "List all the trip IDs that belong to a {specific} route.",
    "Retrieve the stop ID for {given} stop name in the GTFS feed.",
    "Identify the first and last service times for {given} route.",
    "Find the top 5 busiest stops (by number of trips) during weekends in the GTFS feed.",
    "Generate a frequency distribution of trip durations for {given} route on the busiest day.",
    "Analyze the distribution of trip lengths for a {specific} route.",
    "Identify routes that operate exclusively on weekdays.",
    "Determine the longest trip time in seconds for a {specific} route.",
    "Calculate the total number of unique stop sequences for each trip.",
    "Identify the days on which a {specific} service is not available in the GTFS feed.",
    "Retrieve the first and last stop times for all trips in the GTFS feed.",
    "Find the stop that has the most arrivals in the GTFS feed.",
    "Find the stop with the most trips passing through it in the GTFS feed.",
    "Calculate the percentage of trips that are express services (i.e., skip at least one stop) for {given} route.",
    "Identify the routes that are serviced by at least three different stops in the GTFS feed.",
    "Extract and print the list of unique service IDs for all routes in the GTFS feed.",
    "Find all routes that operate on weekends in the GTFS feed.",
    "Identify all active services for each service ID in the GTFS feed on the busiest week.",
    "Find the stop with the highest number of incoming trips.",
    "Extract route names and their corresponding route IDs from the GTFS feed.",
    "Find all trips for {given} route in the GTFS feed and return the trip details including `trip_id` and `service_id`.",
    "Determine the maximum distance between stops for {given} trip.",
    "Find the route with the highest variability in trip duration throughout the day.",
    "Find the stops that are connected by a direct trip for {given} route in the GTFS feed.",
    "Find the route with the highest on-time performance (assuming a 5-minute tolerance) for {given} day in the GTFS feed.",
    "Determine the average number of trips per day across the entire GTFS feed.",
    "Identify all routes that do not have any trips listed for {given} service ID.",
    "Calculate the average trip duration for each hour of the day on the busiest date in the GTFS feed.",
    "Find the most common transfer point (stop where the most routes intersect) in the GTFS feed.",
    "Determine the number of trips that serve a {specific} stop id.",
    "Identify stops that are not being served by any active trips in the GTFS feed.",
    "Identify the routes that serve a {specific} stop in the GTFS feed.",
    "Find the service ID that covers the most number of dates in the GTFS feed.",
    "Find the time of day when the most trips are active simultaneously in the GTFS feed.",
    "Find the stop with the longest average dwell time (time spent at the stop) in the GTFS feed.",
    "Extract the geographical coordinates (latitude and longitude) of all stops in the GTFS feed.",
    "Calculate the total service hours for a {specific} route on {given} date.",
    "Find the latest arrival time across all trips in the GTFS feed.",
    "Calculate the percentage of routes that have at least one trip operating 24\/7 (i.e., at least one trip every hour of every day).",
    "Filter trips based on a {specific} service id and count them.",
    "Find the longest trip in the GTFS feed based on distance traveled.",
    "Calculate the frequency of trips for each route on the busiest day.",
    "Count the total number of unique routes that have service on weekends within the GTFS feed.",
    "Find the number of trips that have more than 10 stops in the GTFS feed.",
    "Find all unique shapes in the GTFS feed and their corresponding routes.",
    "List unique stop names that belong to {given} `route_id`.",
    "Retrieve all trips for a {specific} route and date.",
    "Determine the total number of trips scheduled for each day within the GTFS feed.",
    "Determine the range of service dates available in the GTFS feed by identifying the earliest and latest service dates.",
    "Identify the bus routes that service a {specific} stop.",
    "Find the average frequency of trips for each route in {given} day.",
    "Calculate the percentage of trips in the GTFS feed that are wheelchair accessible.",
    "Find out how many distinct services operate during weekends in the GTFS feed.",
    "Identify the stops that are only served by express trips (trips that skip stops) for {given} route.",
    "Identify services that run on weekdays but not on weekends from the GTFS feed.",
    "Identify stops that are only served during {specific} times of the day (e.g., only morning or evening).",
    "Retrieve the total count of trips for a {specified} `service_id`.",
    "Find the stop with the highest number of transfers (defined as stops where multiple routes intersect)."
]