[
  "GTFSフィード内の各トリップのうち、最も移動距離が長いトリップを持つルートを特定してください。",
  "GTFSフィードで運行サービスが提供されている日付を見つけてください。",
  "すべてのservice_idを通じたGTFSフィード内の総トリップ数を数えてください。",
  "GTFSフィードのstop_timesおよびtransfersデータを分析し、最も混雑する乗換地点を特定してください。",
  "平日のみ運行されるすべてのサービスを特定してください。",
  "GTFSフィード内の全ルートを通じて最も一般的な停留所位置を見つけてください。",
  "特定のservice_idで運行されるトリップをGTFSフィードから抽出してください。",
  "移動距離の観点で最も長いルートを見つけてください。",
  "GTFSフィードに存在する一意なroute_idを抽出してください。",
  "トリップ頻度が最も高いservice_idを特定してください。",
  "stop_times内の一意なtrip_id数に基づき、最も多くの乗換が必要なルートを特定してください。",
  "ある停留所が複数のルート上に存在するかどうかを判定してください。",
  "提供ルート数に基づき、ネットワーク内で最も混雑する停留所を見つけてください。",
  "各停留所への到着回数を算出し、停留所利用頻度を分析してください。",
  "時刻表と距離に基づき、平均速度が最も高い／低いルートを見つけてください。",
  "GTFSフィードを読み込み、すべての一意なstop_idを抽出してください。",
  "GTFSフィード内のshapeにおける最大のshape_dist_traveledを抽出してください。",
  "GTFSフィードに存在する一意なroute_typeを特定し、その一覧を返してください。",
  "GTFSフィード内で最も早い到着時刻を持つ停留所を見つけてください。",
  "移動時間が30分を超えるトリップ区間の数を算出してください。",
  "重要なGTFSテーブル（stopsおよびroutes）に欠損値がないか確認してください。",
  "ピーク時間帯（例：7時〜9時）に運行されるルート数を算出してください。",
  "平均トリップ所要時間が最も短いルートを特定してください。",
  "運賃情報が紐づいていないroute_idをすべて特定してください。",
  "最も移動時間が長い停留所ペアを見つけてください。",
  "GTFSフィードで定義されているが、トリップが存在しないroute_idを一覧化してください。",
  "平日にトリップが設定されていないルートを特定してください。",
  "双方向（両方向）に運行されるルートを特定してください。",
  "全ルートにわたるトリップ所要時間の頻度分布を作成してください。",
  "始点と終点が同じ循環ルートをすべて見つけてください。",
  "1つの停留所で交差するルート数に基づき、最も混雑する乗換地点を特定してください。",
  "GTFSフィードにおけるルート別トリップ数の要約レポートを作成してください。",
  "曜日ごとの総トリップ数を算出してください。",
  "最も混雑する日付におけるservice_id別トリップ数を抽出してください。",
  "GTFSフィードでサービスが提供されている日付を読み取ってください。",
  "空間分析のため、地理情報付きでGTFSフィードを読み込んでください。",
  "平日と週末におけるservice_idの分布を分析してください。",
  "GTFSフィードにおける最初と最後のサービス日を見つけてください。",
  "全停留所の地理的中心（セントロイド）を算出してください。",
  "停留所数の観点で最も長い連続ルートを見つけてください。",
  "他ルートと共有される停留所数が最も多いルートを見つけてください。",
  "最も混雑する日における各ルートの総運行時間を算出してください。",
  "平日のみ運行されるすべてのトリップを一覧化してください。",
  "停留所順序の組み合わせとして一意なトリップパターン数を算出してください。",
  "トリップ数が最も多い日付を特定してください。",
  "最も混雑する日に関連するservice_idの数を算出してください。",
  "全ルートを通じてトリップ頻度が最も高い時間帯を特定してください。",
  "トリップ参加数が最も少ない停留所を特定してください。",
  "route_type別のトリップ割合を算出してください。",
  "最も混雑する週におけるserviceあたり平均トリップ数を算出してください。",
  "トリップが1本しかないルートを一覧化してください。",
  "トリップが設定されていないルートが存在するか確認してください。",
  "route_type別にルート数を算出してください。",
  "最も多くのルートが乗り入れる停留所を特定してください。",
  "最長トリップに対応するroute_idを取得してください。",
  "1トリップあたり停留所数が最も多いルートを見つけてください。",
  "全ルートのピーク運行時間帯を特定してください。",
  "停留所間を直行で結ぶトリップ数が最も多い停留所ペアを特定してください。",
  "週末のみ利用される停留所を見つけてください。",
  "最も混雑する週における全サービスの総トリップ数を算出してください。",
  "車椅子非対応の停留所数を算出してください。",
  "GTFSフィード内で最も停留所数が多いルートを見つけてください。",
  "全サービスについて、日別の総トリップ数を算出してください。",
  "GTFSフィードで最も混雑する週を返してください。",
  "所要時間が最も短いトリップを特定してください。",
  "公共交通利用が最も多い曜日を特定してください。",
  "最も多くのトリップが通過する区間（停留所間）を特定してください。",
  "連続してサービスが提供されている最長日数を見つけてください。",
  "最も混雑する週に少なくとも1本のトリップを持つservice_idをすべて抽出してください。",
  "GTFSデータに含まれる一意なルート数を数えてください。",
  "最も混雑する日における時間帯別のトリップ数および運行ルート数を算出してください。",
  "週末に運行されるトリップ数を数えてください。",
  "平日における総所要時間が最も長いルートを見つけてください。",
  "最も混雑する日に運行されるすべてのルートを抽出してください。",
  "ルートの起点から最も距離が離れている停留所を特定してください。",
  "トリップ間の平均待ち時間が最も長い停留所を見つけてください。",
  "最も混雑する日における全トリップの総移動距離を算出してください。",
  "GTFSフィードから地理情報を読み取ってください。",
  "曜日別の最初および最後の運行時刻を特定してください。",
  "トリップ数に基づく上位5つの最混雑停留所を特定してください。",
  "祝日に運行されるservice_idを抽出してください。",
  "最も多くのルートが乗り入れる停留所を特定してください。",
  "平日運行ルートのみを抽出し、route_idを出力してください。",
  "複数ルートが乗り入れる乗換停留所の数を算出してください。",
  "到着回数が最も多い停留所を特定してください。",
  "各ルートについて最大トリップ距離を算出してください（停留所間距離が均等であると仮定）。",
  "ルート別トリップ分布を分析し、最もトリップ数が多いルートを特定してください。",
  "週末に運行されるservice_idを特定してください。",
  "地下鉄（subway）に該当するルートの割合を算出してください。",
  "最も混雑する日における特定service_idの総トリップ数を算出してください。",
  "あるルートに属する全トリップの総移動距離を算出してください。",
  "祝日に運行されるトリップの割合を算出してください。",
  "最も混雑する週においてトリップ数が最大のルートを特定してください。",
  "ルートごとの1日平均トリップ数を算出してください。",
  "最も混雑する日における最大待ち時間を持つ停留所を特定してください。",
  "最も早く運行を開始するルートと、最も遅く運行を終了するルートを特定してください。",
  "最も混雑する日におけるルート別トリップ数を算出してください。",
  "異なる事業者間で最も混雑する乗換地点を特定してください。",
  "移動距離が最も長いトリップを特定してください。",
  "異なるトリップパターン数が最も多いルートを特定してください。",
  "出発回数が最も多い停留所名を取得してください。",
  "全ルートを通じてサービス頻度が最も高い時間帯を特定してください。",
  "GTFSフィードに含まれるroute_typeとその件数を一覧化してください。",
  "最も混雑する日においてトリップ数が最も多い停留所を特定してください。",
  "重複するroute_idが存在しないか確認してください。",
  "現在も有効なサービスの中で最も古いものを特定してください。",
  "GTFSフィード内で最も早い出発時刻を取得してください。",
  "全トリップの平均所要時間を算出してください。",
  "到着間隔の平均が最も短い停留所を特定してください。",
  "shapeデータに基づき最も長いルートを特定してください。",
  "全ルートの平均距離を算出してください。",
  "1トリップあたり最大停留所数を特定してください。",
  "総移動距離が最も長いルートを特定してください。",
  "平日に対応するservice_idをすべて一覧化してください。",
  "ルート別のトリップ分布を分析してください。",
  "週末運行トリップのみを抽出してください。",
  "同日に開始・終了するサービスを特定してください。",
  "特定の停留所に乗り入れる一意なルート数を算出してください。",
  "複数ルートが交差する乗換停留所を特定してください。",
  "週末に運行されるルートを特定してください。",
  "route_typeの多様性を評価してください。",
  "トリップが割り当てられているstop_idをすべて抽出してください。",
  "全ルートで使用される一意な停留所数を算出してください。",
  "ルート数と停留所数のサマリーレポートを作成してください。",
  "GTFSフィードに基づき最長ルート距離を算出してください。",
  "トリップ数に基づき最も利用されているルートを特定してください。",
  "トリップ数上位3停留所を特定してください。",
  "GTFSフィード内で週末に運行されるすべてのルートを抽出してください。",
  "最も混雑する週において、各service_idごとの有効サービスを特定してください。",
  "最も多くのルートが接続する乗換停留所を特定してください。",
  "最も頻繁に運行されるルートと、最も運行頻度が低いルートを特定してください。",
  "GTFSフィードに含まれるすべての一意なservice_idを一覧化してください。",
  "GTFSフィードにおけるサービス提供期間（日付範囲）を特定してください。",
  "車椅子対応の停留所をすべて抽出してください。",
  "平日朝（6時〜10時）において運行頻度（時間あたりトリップ数）が最も高いルートを特定してください。",
  "GTFSフィードに含まれるservice_idの総数を算出してください。",
  "最も混雑する日においてトリップ数が最大のroute_idを特定してください。",
  "各ルートについて、車椅子対応トリップの割合を算出してください。",
  "週末に運行される一意なルート数を算出してください。",
  "車椅子対応サービスを提供しているルート一覧を取得してください。",
  "複数ルートが乗り入れるすべてのstop_idを抽出してください。",
  "全トリップを通じて最も頻繁に利用される停留所を特定してください。",
  "GTFSフィードに含まれるroute_typeの種類数を算出してください。",
  "運賃が不要なルートをすべて特定してください。",
  "停留所別トリップ数に基づく上位5停留所を特定してください。",
  "平日において最も運行頻度が高いルートを特定してください。",
  "総移動距離に基づきネットワーク内で最も長いルートを特定してください。",
  "direction_idが2つ以上存在するルート数を算出してください。",
  "特定の停留所で接続するすべてのルートを抽出してください。",
  "名称に「Station」を含む一意な停留所名をすべて抽出してください。",
  "全トリップを通じて最も早い出発時刻を特定してください。",
  "車椅子対応の停留所数を算出してください。",
  "GTFSフィード全体で最も距離が長いトリップを特定してください。",
  "最も混雑する日に運行されるトリップ数を算出してください。",
  "最も所要時間が長いトリップを含むルートを特定してください。",
  "サービス種別が「express」であるルートを特定してください。",
  "複数のshapeを持つルートを特定してください。",
  "全ルートを通じて最長のサービス時間帯を特定してください。",
  "各ルートについて、停留所間で最も長い連続区間を特定してください。",
  "週末（土日）に運行されるすべてのトリップを抽出してください。",
  "GTFSフィードに含まれるservice_idの種類数を算出してください。",
  "深夜0時以降に運行されるトリップを少なくとも1本持つルート数を算出してください。",
  "利用可能なサービス日付に基づきGTFSフィードの期間を特定してください。",
  "24時間運行（すべての時間帯にトリップが存在）するルートを特定してください。",
  "距離が最も短いルートを特定してください。",
  "GTFSフィードに含まれるすべてのroute_idを取得してください。",
  "夕方時間帯（17時〜22時）に運行されるトリップを抽出してください。",
  "平日における深夜時間帯（0時〜5時）に運行されるルートの割合を算出してください。",
  "停留所ごとの滞留時間が最も長い／短い地点を特定してください。",
  "日付別のトリップ数を算出してください。",
  "週末に一切運行されない停留所を特定してください。",
  "トリップ数に基づき最も混雑する日付を特定してください。",
  "全ルートのトリップ数レポートを作成してください。",
  "トリップ数に基づき最も混雑する週を特定してください。",
  "trip_idおよびservice_idの重複に基づき、重複トリップを特定してください。",
  "週末運行が存在しないルートを特定してください。",
  "1ルートのみに属する孤立停留所数を算出してください。",
  "最も多くのルート間乗換が発生する停留所を特定してください。",
  "出発地と到着地が同一のトリップをすべて抽出してください。",
  "ピーク時間帯（7時〜9時）に運行されるルートをすべて抽出してください。",
  "距離に基づき最も長いトリップを特定してください。",
  "service_id別のトリップ数を算出してください。",
  "最も頻出するservice_idを特定してください。",
  "GTFSフィードに含まれる停留所総数を算出してください。",
  "最も早い出発トリップを持つルートを特定してください。",
  "service_idと対応日付の一覧を取得してください。",
  "最初および最後のサービス日を取得してください。",
  "週末に有効なすべてのservice_idを特定してください。",
  "直行トリップが存在するすべての停留所ペアを特定してください。",
  "曜日による運行変動が最も大きいルートを特定してください。",
  "tripに含まれる一意なshape_idを一覧化してください。",
  "route_idと総トリップ数を含むルートサマリーを作成してください。",
  "車椅子対応停留所の割合を算出してください。",
  "日付と対応するservice_idを取得してください。",
  "週末に運行されるトリップ総数を算出してください。",
  "夕方ピーク時間帯を特定してください。",
  "最も混雑する日における全service_idのトリップ総数を算出してください。",
  "有効なすべてのサービスとその日付を抽出してください。",
  "日曜日に運行されないservice_idを特定してください。",
  "GTFSフィードに含まれるroute_typeを取得してください。",
  "ピーク時間帯（7時〜9時）に運行される一意なroute_idを抽出してください。",
  "平日ピーク時に最も運行頻度が高いルートを特定してください。",
  "GTFSフィードに含まれる一意なルート数を算出してください。",
  "1つのservice_idが持つ最大トリップ数を算出してください。",
  "1日に発生する最大トリップ数を特定してください。",
  "停留所数が最も多いルートを特定してください。",
  "どのトリップにも含まれない停留所を持つルートを特定してください。",
  "停留所時刻が設定されていないトリップを抽出してください。",
  "最も早く運行を開始し、最も遅く終了するルートを特定してください。",
  "バスルートの割合をroute_type別内訳付きで算出してください。",
  "1週間で最も頻繁に運行されるルートを特定してください。",
  "深夜バス（0時以降出発）ルートをすべて特定してください。",
  "曜日別の総トリップ数を算出してください。",
  "各ルートについて車椅子対応トリップの割合を算出してください。",
  "週末に運行されるサービス数を算出してください。",
  "GTFSフィード全体をメモリに読み込んでください。",
  "route_type別のルート数を一覧化してください。",
  "一意なサービス日数を算出してください。",
  "最も混雑する日における最頻service_idを特定してください。",
  "週末におけるルート別平均トリップ数を算出してください。",
  "最も混雑する日にトリップ数が最大のルートを特定してください。",
  "トリップ間隔を分析し、サービスギャップを評価してください。",
  "名称が「Street」で終わる停留所数を算出してください。",
  "出発トリップ数に基づき最も混雑する時間帯を特定してください。",
  "すべてのルートが通過する停留所を特定してください。",
  "トリップ頻度に基づく上位3ルートを特定してください。",
  "ルート別にservice_idの種類数を算出してください。",
  "24時間運行するルートを特定してください。",
  "shape点数に基づき最も長いルートを特定してください。",
  "週末運行ルートの割合を算出してください。",
  "平均より停留所数が少ない快速（express）ルートを特定してください。",
  "サービス開始日および終了日を特定してください。",
  "最初のサービス日を特定してください。",
  "shape距離に基づき最も長いルートを特定してください。",
  "route_type別の平均停留所数を算出してください。",
  "一意な停留所位置数を算出してください。",
  "複数トリップを持つルート数を算出してください。",
  "最も混雑する週におけるトリップとservice_idの対応を取得してください。",
  "サービスカレンダーの欠損から運行中断を検出してください。",
  "GTFSフィード内で最も頻出する停留所を特定してください。",
  "最も多くのルートが乗り入れる停留所を特定してください。",
  "週末に運行されるservice_idをすべて取得してください。",
  "最も多くのトリップを持つservice_idを特定してください。",
  "GTFSフィードに定義された運賃区分数を算出してください。",
  "最も多くのルートが通過する停留所を特定してください。",
  "複数ルートに共通する最長の連続停留所区間を特定してください。",
  "トリップ数に基づき最も混雑するルートを特定してください。",
  "ルート別のサービス頻度を分析してください。",
  "最長トリップが通過する停留所を特定してください。",
  "運賃クラス数を算出してください。",
  "到着回数が最も多い停留所を特定してください。",
  "どのルートにも属さないstop_idをすべて抽出してください。",
  "最も混雑する日における平均トリップ時間を算出してください。",
  "最も混雑する日のピークservice_idを特定してください。",
  "service_idが1つしかないルート数を算出してください。",
  "車椅子乗降可能な停留所を特定してください。",
  "トリップが一切設定されていないルートを特定してください。",
  "停留所あたり平均ルート数を算出してください。",
  "平日におけるルート別総運行時間を算出してください。",
  "1つのservice_idに対する最大トリップ数を算出してください。",
  "停留所名と座標を抽出してください。",
  "GTFSフィード全体での最初および最後のサービス日を特定してください。",
  "車椅子対応停留所を一切通過しないトリップ数を算出してください。",
  "出発回数が最も多い停留所を特定してください。",
  "乗換停留所をルート数順にランキングしてください。",
  "複数ルートが共有する停留所を特定してください。",
  "最も早い始発と最も遅い終発を持つルートを特定してください。",
  "一意なサービスパターン数を算出してください。",
  "最も一般的なroute_typeを特定してください。",
  "最も混雑する日において最大トリップ数を持つルートを特定してください。",
  "最も混雑する日における上位5停留所を特定してください。",
  "最も多くの乗換可能性を持つ停留所を特定してください。",
  "週末に運行されるすべてのルートを一覧化してください。",
  "週末のみ有効な停留所を特定してください。",
  "同一shape_idを共有するルート数を算出してください。",
  "各ルートについて最初のトリップを特定してください。",
  "最も滞留時間が長い停留所を特定してください。",
  "異なるroute_type間で乗換可能な停留所を一覧化してください。",
  "車椅子対応停留所を一覧化してください。",
  "最も所要時間が長いトリップを特定してください。",
  "平日のみ運行されるルートを特定してください。",
  "一度も使用されていないルートを特定してください。",
  "祝日に運行されるservice_idをすべて特定してください。",
  "route_id別のトリップ数分布を分析してください。",
  "停留所の地理的範囲（北・東・南・西端）を算出してください。",
  "GTFSフィード全体で最も混雑するservice_idを特定してください。",
  "週末のみ運行されるルートの総トリップ数を算出してください。",
  "最も遅い出発時刻を持つルートを特定してください。",
  "平日ピーク時における平均待ち時間が最も長い停留所を特定してください。",
  "曜日別の運行サービス数を算出してください。",
  "トリップ別総移動時間を算出し、最長トリップを特定してください。",
  "出発が設定されていない停留所を特定してください。",
  "始点と終点の距離差が最小の循環ルートを特定してください。",
  "すべての乗換停留所を一覧化してください。",
  "最も人気のあるservice_idを特定してください。",
  "最も混雑する日における停留所通過トリップ数を算出してください。",
  "最も多くのルートが訪れる停留所を特定してください。",
  "service_idに対応する有効ルートを取得してください。",
  "ルート別トリップ数を算出し、最大のルートを特定してください。",
  "最も混雑する日における停留所の平均待ち時間を分析してください。",
  "トリップパターンの多様性が最も高いルートを特定してください。",
  "到着回数が最も多い停留所を特定してください。",
  "ルートの地理形状データを抽出してください。",
  "トリップの開始時刻と終了時刻の最頻値を特定してください。",
  "始発・終発時刻からルートの運行時間帯を算出してください。",
  "平日に最も多く運行されるservice_idを特定してください。",
  "週末に運行されないservice_idを特定してください。",
  "GTFSフィードに含まれる一意なルート数を算出してください。",
  "ルートごとの最初および最後の運行時刻を特定してください。",
  "週末における上位5停留所を特定してください。",
  "ルート別トリップ距離分布を分析してください。",
  "平日のみ運行されるルートを特定してください。",
  "トリップごとの一意な停留所順序数を算出してください。",
  "サービスが提供されない日を特定してください。",
  "到着回数が最も多い停留所を特定してください。",
  "最も多くのトリップが通過する停留所を特定してください。",
  "3停留所以上を持つルートを特定してください。",
  "全ルートのservice_id一覧を抽出してください。",
  "週末に運行されるすべてのルートを特定してください。",
  "最も混雑する週におけるservice_id別有効サービスを特定してください。",
  "到着トリップ数が最も多い停留所を特定してください。",
  "GTFS全体での1日平均トリップ数を算出してください。",
  "service_idが設定されていないルートを特定してください。",
  "時間帯別の平均トリップ所要時間を算出してください。",
  "最も一般的な乗換停留所を特定してください。",
  "特定停留所を通過するトリップ数を算出してください。",
  "有効トリップが存在しない停留所を特定してください。",
  "特定停留所を通過するルートを特定してください。",
  "最も多くの日付をカバーするservice_idを特定してください。",
  "同時に最も多くのトリップが運行される時間帯を特定してください。",
  "滞留時間が最も長い停留所を特定してください。",
  "停留所の緯度・経度を抽出してください。",
  "特定日におけるルートの総運行時間を算出してください。",
  "最も遅い到着時刻を特定してください。",
  "距離に基づき最も長いトリップを特定してください。",
  "最も混雑する日におけるルート別運行頻度を算出してください。",
  "週末に運行される一意なルート数を算出してください。",
  "10停留所以上を含むトリップ数を算出してください。",
  "一意なshapeと対応ルートを抽出してください。",
  "日付別トリップ数を算出してください。",
  "最初と最後のサービス日を特定してください。",
  "停留所を通過するバスルートを特定してください。",
  "日単位でのルート別平均運行頻度を算出してください。",
  "車椅子対応トリップの割合を算出してください。",
  "週末に運行されるサービス種類数を算出してください。",
  "快速トリップのみが停車する停留所を特定してください。",
  "平日のみ運行され週末は運行されないサービスを特定してください。",
  "最も多くのルートが交差する停留所を特定してください。"
]