[
    "Identify the route with the longest distance traveled by any of its trips in the GTFS feed.",
    "Find the dates with available service in the GTFS feed.",
    "Count the total number of trips in the GTFS feed across all service IDs.",
    "Identify the busiest transfer points in the network by analyzing stop_times and transfers data in the GTFS feed.",
    "Identify all the services that run on weekdays only.",
    "Find the most common stop location across all routes in the GTFS feed.",
    "Find the trips that operate for a particular service ID in the GTFS feed.",
    "Find the longest route in terms of distance traveled.",
    "Extract the unique route IDs present in the GTFS feed.",
    "Identify the `service_ids` that have the highest frequency of trips.",
    "Find the route with the highest number of transfers required (based on the number of unique trip_ids in stop_times).",
    "Determine if a stop is located on multiple routes in the GTFS feed.",
    "Find the busiest stop in the network based on the number of routes serving it.",
    "Analyze the frequency of stop usage by calculating the total arrival counts at each stop.",
    "Find the routes with the highest and lowest average speed based on scheduled times and distances.",
    "Load the GTFS feed and extract all unique `stop_ids` from the feed.",
    "Extract the maximum `shape_dist_traveled` for any shape in the GTFS feed.",
    "Identify the unique route types present in the GTFS feed and return the list of route types.",
    "Find the stop that has the earliest scheduled arrival time in the GTFS feed.",
    "Compute the number of trip segments that have a travel time greater than 30 minutes in the GTFS feed.",
    "Check for any missing values in critical GTFS tables (stops and routes).",
    "Determine how many routes operate during peak hours (e.g., 7 AM to 9 AM).",
    "Identify the route with the shortest average trip duration in the GTFS feed.",
    "Identify all route IDs that do not have any associated fare information.",
    "Find the stop pair with the longest travel time between them in the GTFS feed.",
    "Find and list all route IDs that have been defined in the GTFS feed but currently have no associated trips.",
    "Identify routes that have no trips scheduled on weekdays.",
    "Identify the routes that have bi-directional service (trips in both directions).",
    "Create a frequency distribution of trip durations across all routes in the network.",
    "Find all routes that are circular (start and end stop are same)",
    "Identify the busiest transfer point in the network based on the number of routes intersecting at a stop.",
    "Create a summary report of the number of trips per route in the GTFS feed.",
    "Calculate the total number of trips for each day of the week in the GTFS feed.",
    "Extract the trip counts for each service ID on the busiest date in the GTFS feed.",
    "Read the dates for which the GTFS feed has service data.",
    "Load the GTFS feed with geographic data for spatial analysis.",
    "Analyze the distribution of service IDs across weekdays and weekends in the GTFS feed.",
    "Find the earliest and latest service dates in the GTFS feed.",
    "Find the geographical center (centroid) of all stops in the GTFS feed.",
    "Find the longest continuous route (in terms of number of stops) in the GTFS feed.",
    "Find the route with the highest number of transfer points (stops shared with other routes).",
    "Calculate the total operating hours for each route on the busiest day.",
    "List all trips that operate on weekdays only in the GTFS feed.",
    "Find the number of unique trip patterns (combination of stops visited in sequence) in the GTFS feed.",
    "Read the busiest date in terms of the number of trips in the GTFS feed.",
    "Find the number of service IDs associated with a trip on the busiest date.",
    "Find the time period with the highest frequency of trips across all routes.",
    "Identify the least used stop in the GTFS feed based on the number of trips it is part of.",
    "Calculate the proportion of trips made by each route type in the GTFS feed.",
    "Determine the average number of trips per service on the busiest week.",
    "List the routes that have only one trip in the GTFS feed.",
    "Check for any routes in the GTFS feed that have no trips scheduled.",
    "Determine the route types available in the GTFS feed and count the number of each type.",
    "Identify the stop with the most transfers (different routes serving the stop) in the GTFS feed.",
    "Retrieve the route ID for the longest trip in the GTFS feed.",
    "Find the route which has the highest number of stops in a trip",
    "Determine the peak service hours for all routes in the GTFS feed.",
    "Find the stop pair with the highest number of direct connections (trips that serve both stops without intermediate stops) in the entire GTFS feed.",
    "Find the stops that are only active on weekends.",
    "Determine the total trip count for all services on the busiest week in the GTFS feed.",
    "Find the total number of stops that are not wheelchair accessible in the GTFS feed.",
    "Find the route with the most stops in the GTFS feed.",
    "Find the total number of trips per day for all services in the GTFS feed.",
    "Return the busiest week in the GTFS feed.",
    "Determine the shortest scheduled trip in terms of duration in the GTFS feed.",
    "Identify the busiest day of the week for public transport usage in the GTFS feed.",
    "Find the segment that is traversed the highest number of times by trips in the feed",
    "Find the longest sequence of consecutive days with active services in the GTFS feed.",
    "Find all service IDs that have at least one trip on the busiest week in the GTFS feed.",
    "Count the distinct routes available in the GTFS data.",
    "Calculate the total number of trips and unique routes operating during each hour of the day on the busiest day in the GTFS feed.",
    "Count the number of trips with service on weekends in the GTFS feed.",
    "Find the route with the longest total duration (sum of all trip durations) on a weekday.",
    "Find all routes served on the busiest day in the GTFS feed.",
    "Find which stop has the longest distance traveled from the start of its route.",
    "Find the stop with the longest average waiting time between consecutive trips.",
    "Calculate the total distance covered by all trips in the GTFS feed on the busiest day.",
    "Read the geographical information from the GTFS feed.",
    "Find the earliest and latest operating hours for each day of the week.",
    "Identify the top 5 busiest stops based on the total number of trips.",
    "Extract service IDs for all services operating on holidays.",
    "Find the stop with the most transfers (i.e., served by the most routes) in the GTFS feed.",
    "Filter the GTFS feed for routes that have weekday service and print their IDs.",
    "Find the number of transfer points (stops served by more than one route) in the GTFS feed.",
    "Find the stop with the highest number of arrivals in the GTFS feed.",
    "Calculate the maximum trip distance for each route in the GTFS feed, assuming stop distances are uniform.",
    "Analyze the distribution of trips across routes and output the route with the most trips.",
    "Determine the service IDs active on weekends in the GTFS feed.",
    "Calculate the percentage of routes that are of type subway in the GTFS feed.",
    "Determine the total number of trips in the GTFS feed for `service_id` on the busiest day.",
    "Determine the total distance covered by all trips of a route.",
    "Calculate the percentage of trips that operate on holidays.",
    "Find the route with the highest number of trips during the busiest week.",
    "Calculate the average number of trips per day in the GTFS feed for route.",
    "Find the maximum wait time at any stop in the GTFS feed on the busiest day.",
    "Find the route that operates the earliest in the morning and the route that operates the latest at night.",
    "Determine the number of trips made on each route for the busiest day in the GTFS feed.",
    "Identify the busiest transfer points between different agencies in the GTFS feed.",
    "Identify the trips that cover the most distance in the GTFS feed.",
    "Find the route with the highest number of different trip patterns.",
    "Retrieve the name of the stop with the most departures in the GTFS feed.",
    "Identify the time period with the highest service frequency across all routes in the GTFS feed.",
    "Identify all unique route types present in the GTFS feed and their counts.",
    "Find the busiest stop in terms of the number of trips serving it on the busiest day.",
    "Check for any duplicate route IDs in the GTFS feed.",
    "Identify the oldest active service in the GTFS feed.",
    "Retrieve the earliest departure time from the GTFS feed.",
    "Calculate the average trip duration across all trips in the GTFS feed.",
    "Find the stop with the shortest average time between arrivals in the GTFS feed.",
    "Identify the longest route in the GTFS feed based on the shape data.",
    "Find and print the average distance of all routes in the GTFS feed.",
    "Determine the maximum number of stops for any individual trip in the GTFS feed.",
    "Find the route with the longest total distance in the GTFS feed.",
    "Identify and list all service IDs that correspond to the weekdays in the GTFS feed.",
    "Analyze the distribution of trips per route across the GTFS feed.",
    "Filter the GTFS feed to include only trips that run on weekends.",
    "Find the service that starts and ends on the same day in the GTFS feed.",
    "Determine the number of unique routes serving a particular stop.",
    "Find the stops that are transfer points between two or more routes.",
    "Find the route that operates on weekends within the GTFS feed.",
    "Evaluate the variation in route types present in the GTFS feed.",
    "Extract all the unique `stop_ids` that have associated trips in the GTFS feed.",
    "Find the total number of different stops used across all routes in the GTFS feed.",
    "Compile a report of the total number of routes and stops in the GTFS feed.",
    "Calculate the longest route in terms of distance from the GTFS feed.",
    "Identify the most popular route based on the number of trips in the GTFS feed.",
    "Find the top three stops by the number of trips served in the GTFS feed.",
    "Read all available trip counts by date in the GTFS feed.",
    "Find the service IDs that operate only on weekdays.",
    "Determine the number of unique stop sequences across all trips in the GTFS feed.",
    "Identify the most frequent `service_id` for trips on all routes in the GTFS feed.",
    "Find the stop that serves as the most used transfer point between different routes in the GTFS feed.",
    "Find the stops that are served by the most number of distinct routes.",
    "Count the number of routes that have trip patterns that run in both directions in the GTFS feed.",
    "Check if a route_id exists in the GTFS feed.",
    "Find the service IDs that correspond to the days with the least service in the GTFS feed.",
    "Identify the routes with the highest and lowest service span (time between first and last trip) on weekdays.",
    "Identify the highest number of trips scheduled in a single day.",
    "Find the stop pair with the highest number of direct connections (trips without transfers) between them.",
    "Identify the latest service ID in the GTFS feed based on the service period.",
    "Find the longest continuous service period (in days) for any route in the GTFS feed.",
    "Identify the route with the shortest travel time based on stop times.",
    "Find the earliest and latest operating dates for services in the GTFS feed.",
    "Find the service IDs that are active on Mondays but not on Sundays in the GTFS feed.",
    "Find the stop with the highest number of departures per day.",
    "Find all trips that start and end at the same stop for all routes.",
    "Find out which routes have the most connections in the GTFS feed.",
    "List all routes in the GTFS feed along with their trip counts.",
    "Find all the routes that have at least 100 trips in the GTFS feed.",
    "Find the service IDs that have no active trips during the weekend.",
    "Identify all the routes that have been added in the last year using the GTFS feed.",
    "List all service IDs along with their corresponding active dates in the GTFS feed.",
    "Identify the stops that are only served during peak hours in the GTFS feed.",
    "Analyze the distribution of trips across different days of the week in the GTFS feed.",
    "Generate a list of routes that have no active service on weekends in the GTFS feed.",
    "Find the total number of trips on the busiest day in the GTFS feed.",
    "Load the GTFS feed and extract the geographical shapes data.",
    "Identify all service IDs that have trips on multiple days in the GTFS feed.",
    "Find the transfer points (stops shared by multiple routes) with the highest number of connecting routes.",
    "Identify the routes with the most and least frequent service in the GTFS feed.",
    "List all the unique service IDs available in the GTFS feed.",
    "Find the date range for service availability in the GTFS feed.",
    "Find all stops that are wheelchair accessible in the GTFS feed.",
    "Find the route with the highest frequency (trips per hour) during weekday mornings (6-10 AM).",
    "Determine the number of available service IDs in the GTFS feed.",
    "Determine the busiest route ID based on the number of trips on the busiest date.",
    "Calculate the percentage of accessible trips (trips using wheelchair-accessible vehicles) for each route.",
    "Find the number of unique routes operating on weekends in the GTFS feed.",
    "Retrieve the list of routes with wheelchair-accessible services in the GTFS feed",
    "Find all stop IDs that are served by more than one route.",
    "Determine the most frequent stop among all trips in the GTFS feed.",
    "Determine the number of different route types available in the GTFS feed.",
    "Find all routes that do not require a fare in the GTFS feed.",
    "Find the top 5 busiest stops based on the number of trips serving each stop.",
    "Find the route with the highest frequency of service during weekdays.",
    "Determine the longest route in the network based on the total distance traveled.",
    "How many routes have more than one `direction_id` in the GTFS feed.",
    "Find all routes that connect at a certain stop.",
    "Find all the unique stop names that contain the word 'Station' in the GTFS feed.",
    "Find the earliest departure time across all trips in the GTFS feed.",
    "Find how many stops in the GTFS feed are wheelchair accessible",
    "Find the longest trip (by distance) in the entire GTFS feed.",
    "Determine how many trips operate on the busiest date in the GTFS feed.",
    "Find the routes in the GTFS feed that have a trip with the longest duration.",
    "Identify routes that have a service type of 'express' in the GTFS feed.",
    "Identify which routes have more than one shape associated with them in the GTFS feed.",
    "Identify the longest service span across all routes in the GTFS feed.",
    "Find the longest continuous segment without stops for each route in the GTFS feed.",
    "Identify all trips that run on weekends (Saturday and Sunday) in the GTFS feed.",
    "Find out how many different service IDs exist in the GTFS feed.",
    "Count the number of routes that have at least one trip operating after midnight.",
    "Find the date range of the GTFS feed based on available service dates.",
    "Identify the routes that operate 24/7 (have trips starting in every hour of the day).",
    "Find the shortest route in the GTFS feed by distance.",
    "Get the list of all available route IDs in the GTFS feed.",
    "List the trips that operate during evening hours (e.g., 5 PM to 10 PM).",
    "Calculate the percentage of routes that operate during nighttime hours (12 AM to 5 AM) on weekdays.",
    "Find the stops with the longest and shortest dwell times in the GTFS feed.",
    "Find the trip counts for each date in the GTFS feed.",
    "Identify all stops that are not served on weekends.",
    "Read the GTFS feed and return the busiest date based on the most number of trips.",
    "Generate a report of the trip counts for all routes in the GTFS feed.",
    "Find the busiest week for trips in the GTFS feed",
    "Identify any duplicate trips based on `trip_id` and `service_id` in the GTFS feed.",
    "Identify routes that have no weekend service.",
    "Count the number of stops that are isolated i.e. present on only one route",
    "Identify the stops with the most number of transfers between routes in the GTFS feed.",
    "Find all the trips that have the same stop as both their departure and arrival in the GTFS feed.",
    "Find all the routes that operate during peak hours (e.g., 7 AM to 9 AM) using the GTFS feed.",
    "Find the longest trip in the GTFS feed based on distance.",
    "Find the number of trips for each service ID in the GTFS feed.",
    "Identify the most common service IDs in the GTFS feed.",
    "Count the total number of stops in the GTFS feed.",
    "Identify the route with the earliest departing trip in the GTFS feed.",
    "Get the list of unique service IDs and corresponding dates from the GTFS feed.",
    "Retrieve the first and last service date from the GTFS feed.",
    "Identify all active service IDs on weekends from the GTFS feed.",
    "Identify all stop pairs that have direct trips between them in the GTFS feed.",
    "Find the route with the most variations in its schedule across different days of the week.",
    "List all unique shape IDs from the trips in the GTFS feed.",
    "Create a route summary for all routes, including `route_id` and the total number of trips.",
    "Calculate the percentage of accessible stops (`wheelchair_boarding` = 1) in the GTFS feed.",
    "Read the dates and their corresponding service IDs from the GTFS feed.",
    "Assess and print the total number of trips scheduled on weekends.",
    "Identify the evening peak hours for trips in the GTFS feed.",
    "Count the total number of trips for all service IDs on the busiest date.",
    "Extract all active services and their corresponding dates from the GTFS feed.",
    "Identify the service IDs that don't operate on Sundays within the GTFS feed.",
    "Retrieve the distinct route types available in the GTFS feed.",
    "List all unique `route_ids` that have trips scheduled during peak hours (7 AM to 9 AM).",
    "Determine the route with the most frequent service during peak hours (7-9 AM) on weekdays.",
    "Retrieve the total number of unique routes in the GTFS feed.",
    "Determine the maximum number of trips that a service ID has.",
    "Identify the maximum number of trips that occur in a single day in the GTFS feed.",
    "Identify the routes with the most stops based on the GTFS feed data.",
    "Identify which routes have a stop that is not served by any trips in the GTFS feed.",
    "Retrieve all trips that have no scheduled stop times in the GTFS feed.",
    "Identify the routes with the earliest start time and latest end time in the GTFS feed.",
    "Calculate the proportion of bus routes in the GTFS feed, including a breakdown of all route types.",
    "Identify the route that is scheduled to operate the most frequently within a week.",
    "Identify all night bus routes (routes with trips starting after midnight) in the GTFS feed.",
    "Calculate the total number of trips operated on each day of the week in the GTFS feed.",
    "Calculate the percentage of wheelchair-accessible trips for each route in the GTFS feed.",
    "Count how many services are scheduled on weekends within the GTFS feed.",
    "Load the entire GTFS feed into memory for further processing.",
    "List the route types available in the GTFS feed with their counts.",
    "Count the number of unique service dates available in the GTFS data.",
    "Retrieve the busiest service id on the most active day in the GTFS feed.",
    "Calculate the average number of trips per route on weekends.",
    "Identify the route with the most trips on the busiest date in the GTFS feed.",
    "Analyze the service gaps by examining the time intervals between trips for a route.",
    "Find the number of stops with `stop_name` ending with `Street` in the GTFS feed.",
    "Find the busiest hour of the day based on the number of trip departures across all stops.",
    "Find the stops that are served by all routes in the GTFS feed.",
    "Identify the top three busiest routes in the GTFS feed based on trip frequency.",
    "Analyze service patterns by counting the number of unique service IDs for each route in the GTFS feed.",
    "Find the routes that operate 24/7 (all days of the week, including overnight service) in the GTFS feed.",
    "Determine the longest route based on the number of shape points in the GTFS feed.",
    "Calculate the proportion of routes that operate on weekends in the GTFS feed.",
    "Identify express routes (routes with fewer stops than average) in the GTFS feed.",
    "Find the first and last dates of service in the GTFS feed.",
    "Analyze and print the first service date in the GTFS feed.",
    "Identify the longest route based on shape distance.",
    "Calculate the average number of stops per trip for each route type (e.g., bus, rail, tram) in the GTFS feed.",
    "Check how many unique stop locations exist in the GTFS feed.",
    "Calculate how many routes are served by more than one trip in the GTFS feed.",
    "Find the trips and their corresponding service IDs for the busiest week in the GTFS feed.",
    "Check for any service disruptions by looking for gaps in the service calendar in the GTFS feed.",
    "Determine the most common stop in terms of the number of times it appears in the GTFS feed.",
    "Find the stop with the highest number of routes serving it in the GTFS feed.",
    "Retrieve all the distinct service IDs that operate on weekends.",
    "Discover which `service_id` has the most trips in the GTFS feed.",
    "Determine the number of unique fare attributes defined in the GTFS feed.",
    "Identify the stops with the highest number of different routes passing through them in the GTFS feed.",
    "Find the longest continuous segment (sequence of stops) that is common to multiple routes.",
    "Identify the busiest route based on trip counts in the GTFS feed.",
    "Analyze the frequency of service for each route in the GTFS feed by counting the number of trips per route.",
    "Find the stops passed by the longest trip in the GTFS feed.",
    "Find the number of distinct fare classes available in the GTFS feed.",
    "Evaluate which stop has the most arrivals in the GTFS feed.",
    "List all the unique `stop_ids` that are not served by any route.",
    "Calculate the average service duration for trips on the busiest day of the GTFS feed.",
    "Find the peak service IDs in the GTFS feed for the busiest day.",
    "Count the number of routes that have only one service ID associated with them.",
    "Find the stops that have wheelchair boarding capability in the GTFS feed.",
    "List all routes with no scheduled trips in the GTFS feed.",
    "Find the average number of routes served by each stop in the GTFS feed.",
    "Calculate the total service hours for each route on a typical weekday in the GTFS feed.",
    "Find the maximum number of trips available for any single service ID in the GTFS feed.",
    "Extract the stop names and their coordinates for all stops in the GTFS feed.",
    "Determine the earliest and latest service dates across the GTFS feed.",
    "Count the number of trips that do not stop at any wheelchair accessible stops.",
    "Find the stop with the highest number of departures in the GTFS feed.",
    "Find the transfer points (stops served by multiple routes) in the GTFS feed and rank them by the number of routes they serve.",
    "Identify transfer points in the GTFS feed by finding stops shared by multiple routes.",
    "Find the route with the earliest first trip and the latest last trip in the GTFS feed.",
    "Determine the number of unique service patterns in the GTFS feed.",
    "Find the most common route type in the GTFS feed.",
    "Identify the route with the highest number of trips on the busiest day from the GTFS feed.",
    "Find the top 5 busiest stops (most visits) in the GTFS feed on the busiest day.",
    "Find the stop with the highest number of transfer possibilities (i.e., the stop served by the most routes).",
    "Extract and list all routes that operate on weekends.",
    "Identify the stops that are only active on weekends (i.e., not served by any weekday trips).",
    "Count the number of different routes that share the same `shape_id` in the GTFS feed.",
    "Identify the first trip of the day for each route in the GTFS feed.",
    "Determine which stops have the longest layover times in the GTFS feed.",
    "Generate a list of all transfer points where passengers can switch between different route types (e.g., bus to rail).",
    "List the stops with wheelchair accessibility in the GTFS feed.",
    "Find the trips that have the longest travel time in the GTFS feed.",
    "Find the routes that operate only on weekdays.",
    "Identify the routes that have never been used on any trip in the GTFS feed.",
    "Find all service IDs that operate on holidays from the GTFS feed.",
    "Examine the distribution of trip counts by `route_id` in the GTFS feed.",
    "Determine the geographical bounds (north, east, south, west) of all stops in the GTFS feed.",
    "Identify the busiest service ID over the entire GTFS feed.",
    "Calculate the total number of trips for a route that operates on weekends only.",
    "Find the route with the latest trip departure time.",
    "Identify the stops with the longest average waiting time between trips during weekday peak hours (7-9 AM and 4-6 PM).",
    "Count how many different services operate each day of the week in the GTFS feed.",
    "Calculate the total travel time for each trip in the GTFS feed and find the longest trip.",
    "Find the stops with no scheduled departures in the GTFS feed.",
    "Find the route with the most circular path (smallest difference between start and end coordinates).",
    "Generate a list of all transfer points (stops where multiple routes intersect) in the GTFS feed.",
    "Find the most popular `service_id` in terms of the number of trips.",
    "Calculate the total number of trips that pass through stop on the busiest day in the GTFS feed.",
    "Find the stops that are visited by the maximum number of routes in the GTFS feed.",
    "Find all active routes for a service ID.",
    "Calculate the number of trips for each route in the GTFS feed, and return the route with the highest number of trips.",
    "Analyze the average waiting time at a stop for a route on the busiest day in the GTFS feed.",
    "Identify the route with the most variations in trip patterns (different stop sequences) in the GTFS feed.",
    "Find the stop with the most scheduled arrivals across all routes in the GTFS feed.",
    "Extract the geographical shapes of routes from the GTFS feed.",
    "Find the most common start and end times for trips in the GTFS feed.",
    "Determine the span of service for route by calculating the first and last trip times.",
    "Determine the `service_ids` that operate on the maximum number of weekdays in the GTFS feed.",
    "Identify the service IDs that do not operate on weekends.",
    "Find the number of unique routes in the GTFS feed.",
    "Identify the first and last service times for route.",
    "Find the top 5 busiest stops (by number of trips) during weekends in the GTFS feed.",
    "Analyze the distribution of trip lengths for a route.",
    "Identify routes that operate exclusively on weekdays.",
    "Calculate the total number of unique stop sequences for each trip.",
    "Identify the days on which a service is not available in the GTFS feed.",
    "Find the stop that has the most arrivals in the GTFS feed.",
    "Find the stop with the most trips passing through it in the GTFS feed.",
    "Identify the routes that are serviced by at least three different stops in the GTFS feed.",
    "Extract and print the list of unique service IDs for all routes in the GTFS feed.",
    "Find all routes that operate on weekends in the GTFS feed.",
    "Identify all active services for each service ID in the GTFS feed on the busiest week.",
    "Find the stop with the highest number of incoming trips.",
    "Determine the average number of trips per day across the entire GTFS feed.",
    "Identify all routes that do not have any trips listed for service ID.",
    "Calculate the average trip duration for each hour of the day on the busiest date in the GTFS feed.",
    "Find the most common transfer point (stop where the most routes intersect) in the GTFS feed.",
    "Determine the number of trips that serve a stop id.",
    "Identify stops that are not being served by any active trips in the GTFS feed.",
    "Identify the routes that serve a stop in the GTFS feed.",
    "Find the service ID that covers the most number of dates in the GTFS feed.",
    "Find the time of day when the most trips are active simultaneously in the GTFS feed.",
    "Find the stop with the longest dwell time (time spent at the stop) in the GTFS feed.",
    "Extract the geographical coordinates (latitude and longitude) of all stops in the GTFS feed.",
    "Calculate the total service hours for a route on date.",
    "Find the latest arrival time across all trips in the GTFS feed.",
    "Find the longest trip in the GTFS feed based on distance traveled.",
    "Calculate the frequency of trips for each route on the busiest day.",
    "Count the total number of unique routes that have service on weekends within the GTFS feed.",
    "Find the number of trips that have more than 10 stops in the GTFS feed.",
    "Find all unique shapes in the GTFS feed and their corresponding routes.",
    "Determine the total number of trips scheduled for each day within the GTFS feed.",
    "Determine the range of service dates available in the GTFS feed by identifying the earliest and latest service dates.",
    "Identify the bus routes that service a stop.",
    "Find the average frequency of trips for each route in day.",
    "Calculate the percentage of trips in the GTFS feed that are wheelchair accessible.",
    "Find out how many distinct services operate during weekends in the GTFS feed.",
    "Identify the stops that are only served by express trips (trips that skip stops) for route.",
    "Identify services that run on weekdays but not on weekends from the GTFS feed.",
    "Find the stop with the highest number of transfers (defined as stops where multiple routes intersect)."
]